{"pageProps":{"post":{"title":"Setup Echo web server to serve a Single Page Application (SPA)","date":"2021-01-25","slug":"Echo_Golang_server_for_a_Single_Page_Application_(SPA)","author":"Per Sunde","content":"# Setup Echo web server to serve a Single Page Application (SPA)\nDo you have a Single Page App that is written in React, Vue or maybe Svelte, and you want to use the Golang Echo web framwork to serve your web-app?\nDo you experience issues with the SPA routing? \n\n## Echo has problems with SPA routing\nBy default Echo does not work great with a SPA routing. It should work if you go to the base URL for example https://my-spa-url.com. But if you try to enter something like https://my-spa-url.com/sub-path into your web-browser, then the SPA will not go to the correct page if you serve the files with Echo and you are using Echo's default settings!\n\n## Echo needs configuration to work with SPA\nIf you want to use the Echo webserver framework for Go to serve a SPA you need to configure it to handle the requests properly. An SPA's will not send a request for each sub-url path. Therefore you have to configure your Echo web-server to expect a SPA and serve the files correctly.\n\n## How to make Echo serve a SPA correctly?\nTo make Echo work well with your SPA, you need to enable the HTML5 property for the Echo static middleware. This will enable Echo to behave similarly to your development server that you normally start with a command like `npm start` or `yarn dev`.\n\nSo to make your Echo Golang web-server correctly serve a SPA, you need to add the middleware code shown below. Add this code the same place where you initialize your Echo server:\n\n```go\nimport echoMw \"github.com/labstack/echo/v4/middleware\"\n\ne.Use(middleware.StaticWithConfig(echoMw.StaticConfig{\n\tRoot:   \"public\",\t\t// This is the path to your SPA build folder, the folder that is created from running \"npm build\"\n\tIndex:  \"index.html\",\t// This is the default html page for your SPA\n\tHTML5:  true,\n}))\n```\n\nBelow you can see the full code on how I initialize my simple Echo server to be configured to serve a SPA:\n\n```go\npackage server\n\nimport (\n\t\"github.com/labstack/echo/v4\"\n\techoMw \"github.com/labstack/echo/v4/middleware\"\n)\n\n// Init the echo webserver\nfunc Init() *echo.Echo {\n\n\te := echo.New()\n\n\t// Set Bundle MiddleWare\n\te.Use(echoMw.Logger())\n\te.Use(echoMw.Gzip())\n\n\te.Use(echoMw.StaticWithConfig(echoMw.StaticConfig{\n\t\tRoot:   \"public\",\t\t// This is the path to your SPA build folder, the folder that is created from running \"npm build\"\n\t\tIndex:  \"index.html\",\t// This is the default html page for your SPA\n\t\tBrowse: false,\n\t\tHTML5:  true,\n\t}))\n\n\treturn e\n}\n```\n\nNow your Echo web server will serve your Single Page Application correctly. Have fun :)\n\n\n## Read more about Echo configuration\nRead more about the Ehcho static middleware configuration you can do here:  \nhttps://echo.labstack.com/middleware/static","featuredImage":"/assets/blog/echo server for a spa/golang-react-echo.jpg","readingTime":"3 min read","tags":"Go, Golang, Echo, SPA, React, Single Page Application, Webserver"}},"__N_SSG":true}